import pandas as pd

data = {
    'Имя': ['Алексей', 'Мария', 'Иван', 'Ольга', 'Дмитрий', 'Наталья', 'Сергей', 'Елена', 'Андрей', 'Виктория'],
    'Математика': [1, 5, 3, 5, 4, 3, 4, 5, 3, 4],
    'Русский язык': [5, 4, 3, 5, 4, 5, 4, 3, 4, 5],
    'Физика': [1, 5, 4, 5, 4, 3, 5, 4, 3, 4],
    'Химия': [4, 5, 2, 4, 5, 4, 3, 4, 5, 4],
    'Биология': [5, 2, 5, 5, 4, 3, 4, 5, 4, 5]
}

df = pd.DataFrame(data)

print(df.head())

print(f'Средняя оценка по Математике - {df['Математика'].mean()}')
print(f'Средняя оценка по Русскому языку - {df['Русский язык'].mean()}')
print(f'Средняя оценка по Физике - {df['Физика'].mean()}')
print(f'Средняя оценка по Химии - {df['Химия'].mean()}')
print(f'Средняя оценка по Биологии - {df['Биология'].mean()}')

print(f'Медианная оценка по Математике - {df['Математика'].median()}')
print(f'Медианная оценка по Русскому языку - {df['Русский язык'].median()}')
print(f'Медианная оценка по Физике - {df['Физика'].median()}')
print(f'Медианная оценка по Химии - {df['Химия'].median()}')
print(f'Медианная оценка по Биологии - {df['Биология'].median()}')

Q1_math = df['Математика'].quantile(0.25)
Q3_math = df['Математика'].quantile(0.75)
IQR = Q3_math- Q1_math
print(IQR)

std_math=df['Математика'].std()
std_rus=df['Русский язык'].std()
std_phis=df['Физика'].std()
std_him=df['Химия'].std()
std_bio=df['Биология'].std()

print(f"Стандартное отклонение математика - {std_math}")
print(f"Стандартное отклонение Русский язык - {std_rus}")
print(f"Стандартное отклонение Физика - {std_phis}")
print(f"Стандартное отклонение Химия - {std_him}")
print(f"Стандартное отклонение Биология - {std_bio}")
